<?php

/* 1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка. */

$br = '<br/>';
echo '1) ' . $br;

    $numMin = 0;
    $numMax = 100;
    while($numMin++ <= $numMax)
        if($numMin % 3 == 0)
            echo $numMin . ' ';


/* 2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
0 – это ноль.
1 – нечетное число.
2 – четное число.
3 – нечетное число.
…
10 – четное число. */

echo $br . $br . '2) ' . $br;

    $numMin = 0;
    $numMax = 10;
    do {
        if($numMin == 0) {
            echo $numMin . ' - это ноль.' . $br;
        } elseif ($numMin % 2 == 0) {
            echo $numMin . ' - четное число.' . $br;
        } else {
        echo $numMin . ' - нечетное число.' . $br;
        }
    } while($numMin++ < $numMax);
        
/* 3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, 
а в качестве значений – массивы с названиями городов из соответствующей области. 
Вывести в цикле значения массива, чтобы результат был таким:
Московская область:
Москва, Зеленоград, Клин
Ленинградская область:
Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область … (названия городов можно найти на maps.yandex.ru) */

echo $br . '3) ' . $br;

    $sityArray = [
        "Московская область" => ['Москва', 'Зеленоград', 'Клин'],
        "Ленинградская область" => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
        "Рязанская область" => ['Рязань', 'Касимов', 'Михайлов'],
        "Саратовская область" => ['Саратов', 'Энгельс', 'Балаково', 'Вольск', 'Калининск']
    ];

    foreach($sityArray as $province => $sity) {
        echo "$province:" . $br;
        foreach($sity as $key => $value){
            echo $value . ', ';
        }
        echo $br;
    }
    
/* 4. Объявить массив, индексами которого являются буквы русского языка, 
а значениями – соответствующие латинские буквосочетания 
(‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
Написать функцию транслитерации строк. */

echo $br . '4) ' . $br;
// 'a)'
    function translit($str) {
        $rus = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т',
                'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', 'а', 'б', 'в', 'г', 'д', 'е', 'ё',
                'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ',
                'ъ', 'ы', 'ь', 'э', 'ю', 'я'];
        $lat = ['A', 'B', 'V', 'G', 'D', 'E', 'E', 'Gh', 'Z', 'I', 'Y', 'K', 'L', 'M', 'N', 'O', 'P', 'R', 'S', 'T',
                'U', 'F', 'H', 'C', 'Ch', 'Sh', 'Sch', 'Y', 'Y', 'Y', 'E', 'Yu', 'Ya', 'a', 'b', 'v', 'g', 'd', 'e',
                'e', 'gh', 'z', 'i', 'y', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'f', 'h', 'c', 'ch', 'sh',
                'sch', 'y', 'y', 'y', 'e', 'yu', 'ya'];
        return str_replace($rus, $lat, $str);
    }
    $str = "Прекрасная погода!";
    echo translit($str) . $br;
// 'b)'   
    $translit = [
        'А' => 'A', 'Б' => 'B', 'В' => 'V', 'Г' => 'G', 'Д' => 'D', 'Е' => 'E', 'Ё' => 'YO', 'Ж' => 'Zh', 'З' => 'Z',
        'И' => 'I', 'Й' => 'J', 'К' => 'K', 'Л' => 'L', 'М' => 'M', 'Н' => 'N', 'О' => 'O', 'П' => 'P', 'Р' => 'R',
        'С' => 'S', 'Т' => 'T', 'У' => 'U', 'Ф' => 'F', 'Х' => 'X', 'Ц' => 'C', 'Ч' => 'CH', 'Ш' => 'SH', 'Щ' => 'SHH',
        'Ь' => '\'', 'Ы' => 'Y\'', 'Ъ' => '\'\'', 'Э' => 'E\'', 'Ю' => 'YU', 'Я' => 'YA', 'а' => 'a', 'б' => 'b', 'в' => 'v',
        'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'yo', 'ж' => 'zh', 'з' => 'z', 'и' => 'i', 'й' => 'j', 'к' => 'k',
        'л' => 'l', 'м' => 'm', 'н' => 'n', 'о' => 'o', 'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't', 'у' => 'u',
        'ф' => 'f', 'х' => 'x', 'ц' => 'c', 'ч' => 'ch', 'ш' => 'sh', 'щ' => 'shh', 'ь' => '\'', 'ы' => 'y', 'ъ' => '\'\'',
        'э' => "e\'", 'ю' => 'yu', 'я' => 'ya'
    ];

    $strRus = "Люблю грозу в начале мая!";
    echo $strTranslit = strtr($strRus, $translit) . $br;

    $strLat = "Druz'ya poznayutsya v bede!";
    echo $strTranslit1 = strtr($strLat, array_flip($translit)) . $br;

/* 5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку. */

echo $br . '5) ' . $br;

    $text = "Мама мыла раму!";
    function change1($str) {
        $conver = [' ' => '_'];
        return strtr($str, $conver);
    }

    echo change1($text) . $br;

    function change2($str) {
        return preg_replace('/\s/', '_', $str);
    };
     
    echo change2($text);
    
/* 7. Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. Выглядеть это должно так: for(…){// здесь пусто}*/
echo $br . $br . '7) ' . $br;
    $iter = 9;
    for($i = 0, $j = 1; $i <= $iter; $j += $i, print $i . ' ', $i++);

/* 8. Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К». */
echo $br . $br . '8) ' . $br;

    $letter = 'К';
    foreach ($sityArray as $province => $sity) {
        foreach ($sity as $key => $value) {
            if (strpos($value, $letter) !== false)
            echo $value;
        }
        echo $br;
    }

/* 9. Объединить две ранее написанные функции в одну, которая получает строку на русском языке, 
производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается 
при конструировании url-адресов на основе названия статьи в блогах). */
echo $br . '9) ' . $br;

    function rusTranslite($inputstr) {
        $conv = [
            'А' => 'A', 'Б' => 'B', 'В' => 'V', 'Г' => 'G', 'Д' => 'D', 'Е' => 'E', 'Ё' => 'YO', 'Ж' => 'Zh', 'З' => 'Z',
            'И' => 'I', 'Й' => 'J', 'К' => 'K', 'Л' => 'L', 'М' => 'M', 'Н' => 'N', 'О' => 'O', 'П' => 'P', 'Р' => 'R',
            'С' => 'S', 'Т' => 'T', 'У' => 'U', 'Ф' => 'F', 'Х' => 'X', 'Ц' => 'C', 'Ч' => 'CH', 'Ш' => 'SH', 'Щ' => 'SHH',
            'Ь' => '', 'Ы' => 'Y', 'Ъ' => '', 'Э' => 'E', 'Ю' => 'YU', 'Я' => 'YA', 'а' => 'a', 'б' => 'b', 'в' => 'v',
            'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'yo', 'ж' => 'zh', 'з' => 'z', 'и' => 'i', 'й' => 'j', 'к' => 'k',
            'л' => 'l', 'м' => 'm', 'н' => 'n', 'о' => 'o', 'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't', 'у' => 'u',
            'ф' => 'f', 'х' => 'x', 'ц' => 'c', 'ч' => 'ch', 'ш' => 'sh', 'щ' => 'shh', 'ь' => '', 'ы' => 'y', 'ъ' => '',
            'э' => 'e', 'ю' => 'yu', 'я' => 'ya'
        ];

        $splittext = preg_split ('//u', $inputstr);
        $text = '';
        foreach($splittext as $val) {
            $valConv = $conv[$val];
            $text .= (isset($conv[$val])) ? $conv[$val] : $val;
        }

        return $text;
    }

    function translitUrl($strUrl) {
        $strUrl = rusTranslite($strUrl);
        $strUrl = mb_strtolower($strUrl);
        $strUrl = mb_ereg_replace('[^-0-9a-z]', ' ', $strUrl);
        $strUrl = trim($strUrl, ' ');
        return preg_replace('/\s/', '_', $strUrl);
    }
    
$strUrl = 'Хочу посмотреть как прекрасен этот мир!';
echo translitUrl($strUrl);